{
  "descriptionHtml": "\u003ch2\u003e出版社より\u003c/h2\u003e\n\u003cp\u003e\u003cb\u003ePrinted in full color.\u003c/b\u003e\u003cbr/\u003e\u003cbr/\u003eTo keep doing what you love, you need to maintain your own systems, not just the ones you write code for. Regular exercise and proper nutrition help you learn, remember, concentrate, and be creative--skills critical to doing your job well. Learn how to change your work habits, master exercises that make working at a computer more comfortable, and develop a plan to keep fit, healthy, and sharp for years to come.\u003cbr/\u003e\u003cbr/\u003eSmall changes to your habits can improve your health--without getting in the way of your work. \u003ci\u003eThe Healthy Programmer\u003c/i\u003e gives you a daily plan of action that's incremental and iterative just like the software development processes you're used to. Every tip, trick, and best practice is backed up by the advice of doctors, scientists, therapists, nutritionists, and numerous fitness experts.\u003cbr/\u003e\u003cbr/\u003eWe'll review the latest scientific research to understand how being healthy is good for your body and mind. You'll start by adding a small amount of simple activity to your day--no trips to the gym needed. You'll learn how to mitigate back pain, carpal tunnel syndrome, headaches, and many other common sources of pain. \u003cbr/\u003e\u003cbr/\u003eYou'll also learn how to refactor your diet to properly fuel your body without gaining weight or feeling hungry. Then, you'll turn the exercises and activities into a pragmatic workout methodology that doesn't interfere with the demands of your job and may actually improve your cognitive skills.\u003cbr/\u003e\u003cbr/\u003eYou'll also learn the secrets of prominent figures in the software community who turned their health around by making diet and exercise changes. Throughout, you'll track your progress with a \"companion iPhone app\".\u003cbr/\u003e\u003cbr/\u003eFinally, you'll learn how to make your healthy lifestyle pragmatic, attainable, and fun. If you're going to live well, you should enjoy it.\u003cbr/\u003e\u003cbr/\u003e\u003cb\u003eDisclaimer\u003c/b\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eThis book is intended only as an informative guide for those wishing to know more about health issues. In no way is this book intended to replace, countermand, or conflict with the advice given to you by your own healthcare provider including Physician, Nurse Practitioner, Physician Assistant, Registered Dietician, and other licensed professionals.\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eKeep in mind that results vary from person to person. This book is not intended as a substitute for medical or nutritional advice from a healthcare provider or dietician. Some people have a medical history and/or condition and/or nutritional requirements that warrant individualized recommendations and, in some cases, medications and healthcare surveillance.\u003c/i\u003e \u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eDo not start, stop, or change medication and dietary recommendations without professional medical and/or Registered Dietician advice. A healthcare provider should be consulted if you are on medication or if there are any symptoms that may require diagnosis or medical attention. Do not change your diet if you are ill, or on medication except under the supervision of a healthcare provider. Neither this, nor any other book or discussion forum is intended to take the place of personalized medical care of treatment provided by your healthcare provider.\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eThis book was current as of January, 2013 and as new information becomes available through research, experience, or changes to product contents, some of the data in this book may become invalid. You should seek the most up to date information on your medical care and treatment from your health care professional. The ultimate decision concerning care should be made between you and your healthcare provider.\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eInformation in this book is general and is offered with no guarantees on the part of the author, editor or The Pragmatic Programmers, LLC. The author, editors and publisher disclaim all liability in connection with the use of this book.\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eDeepL 粗訳\u003c/h2\u003e\n\u003cp\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e好きなことを続けていくためには、コードを書くためのシステムだけでなく、自分のシステムを維持する必要があります。定期的な運動と適切な栄養は、学習、記憶、集中、創造性の向上に役立ちます。\u003cbr/\u003e\u003cbr/\u003e「あなたの仕事の習慣を変える方法」「コンピュータでの作業をより快適にするエクササイズをマスターする方法」「来たるべき年のために健康でシャープな状態を維持するための計画を開発する方法」を紹介します。\u003ci\u003e健康的なプログラマー\u003c/i\u003eは、あなたが使用しているソフトウェア開発プロセスのような増分的で反復的なアクションの毎日の計画を与えます。\u003cbr/\u003e\u003cbr/\u003e最新の科学的研究をもとに、健康であることがいかに心身に良いかを理解していきます。\u003cbr/\u003e\u003cbr/\u003eこの記事では、最新の科学的な研究結果を紹介します。\u003cbr/\u003e\u003cbr/\u003eまた、体重を増やしたり、空腹感を感じたりすることなく、適切に栄養を摂取するための食事の摂り方も学びます。\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cb\u003e免責事項\u003c/b\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003eこの本は、健康問題についてもっと知りたいと思っている人のための有益なガイドとしてのみ意図されています。\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003e結果は人によって異なることを念頭に置いてください。この本は、医療提供者や栄養士からの医学的または栄養学的なアドバイスの代わりになることを意図したものではありません。病気の場合や投薬中の場合は、医療機関の監督下にある場合を除き、食事内容を変更しないでください。この本や他の本やディスカッションフォーラムは、医療従事者が提供する治療の個別化された医療に取って代わることを意図したものではありません。また、この本に記載されているデータの中には、無効になっているものもありますので、ご注意ください。\u003c/i\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ci\u003e本書の情報は一般的なものであり、著者、編集者、またはThe Pragmatic Programmers, LLCの保証は一切ありません。著者、編集者、および出版社は、本書の使用に関連するすべての責任を否認します。",
  "tags": [
    "back pain",
    "carpal tunnel",
    "computer",
    "disease",
    "fitness",
    "geek",
    "health",
    "iPhone",
    "prevention",
    "wellness"
  ],
  "title": "The Healthy Programmer",
  "vendor": "Pragmatic Bookshelf",
  "collectionsToJoin": [
    "gid://shopify/Collection/236195152071"
  ],
  "metafields": [
    {
      "id": "gid://shopify/Metafield/17130846552263",
      "key": "published_at",
      "namespace": "k9bookshelf",
      "value": "2013-07-09 00:00:00 +0000 UTC",
      "valueType": "STRING"
    },
    {
      "id": "gid://shopify/Metafield/17130846585031",
      "key": "subtitle",
      "namespace": "k9bookshelf",
      "value": "Get Fit, Feel Better, and Keep Coding",
      "valueType": "STRING"
    },
    {
      "id": "gid://shopify/Metafield/17130846617799",
      "key": "number_of_pages",
      "namespace": "k9bookshelf",
      "value": "254",
      "valueType": "STRING"
    }
  ],
  "variants": [
    {
      "barcode": "9781937785314",
      "inventoryPolicy": "CONTINUE",
      "price": "3630.000000",
      "weight": 0.439984654869,
      "weightUnit": "KILOGRAMS"
    }
  ]
}